content-org/o.org
:PROPERTIES:
:EXPORT_DATE: [2018-11-11 Mon 21:49]
:END:

* Now
:PROPERTIES:
:EXPORT_FILE_NAME: now
:EXPORT_HUGO_SECTION: docs
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 3
:END:

#+attr_html: :class book-hint info
#+begin_quote
When relatives ask me /kar kya rahe ho life mein?/, I feel like responding with /chal bhagg/. But I ultimately end up saying something like [[https://www.youtube.com/watch?v=v4GaJS1C8o4][/matlab aisa bilkul immediate nahi soche hai but sochenge/]]. Now that I have a now page, I'll be able to point them to it.
#+end_quote
previous versions of [[https://github.com/geekodour/o/commits/main/content/docs/now.md][this page]]

** What are you doing?
I am having a headache tonight so I am not going to write this.
** What are you studying?
- Studying things in bulk is almost gone, from now on everything should mostly be incremental study and learning things from experiments and experiences of trying to make things happen
- I made a study topics to projects to work on mapping that I really like. (I think this has been running for several months now but I am not super happy with the progress but there has been some progress)
** What are you thinking about these days?
- I am thinking about a name for the space I am going to turn my house into. Pretty excited about it. AlwaysCookin', Petrichor(?)
- I am also thinking about funding sources for this space as it's a physical space and will be quite busy when operational, there are quite a few sinks here and there.
- I am also thinking about how do I switch to the things I think I'll really enjoy etc. It's complicated I'll probably write a blogpost on this one of these days.
** What did I do this time?
I've learnt my lessons, this time around fortunately I can safely say that I'd not taken any fucked up decision so far.

